W6D3/01_routes_project/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name, :email))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Aatef"], ["email", "baransymusic@gmail.com"]]

    def show
        begin user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        begin User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

    def update
        begin user = User.find(params[:id])
            user.update(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Timothy"], ["id", 1]]