W5D3/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "I3SoJ8h8FpZT4KFQx44OkQ"], ["LIMIT", 1]]
---
    def self.random_code
        random_code = nil
        while random_code.nil? || self.exists?(short_url: random_code)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "google.com"], ["short_url", "9Xy5vcZ7fm3Quov0Dv_24w"], ["user_id", 5], ["created_at", "2020-07-02 00:13:08.825454"], ["updated_at", "2020-07-02 00:13:08.825454"]]
---
    def self.create_new(user, url)
        ShortenedUrl.create!(
            long_url: url,
            short_url: ShortenedUrl.random_code,
            user_id: user.id
        )