W6D4/01_routes_project_p2/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 8], ["viewer_id", 15]]
---
    def create
        artwork_share = ArtworkShare.new(self.artwork_share_params)
        if artwork_share.save

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 13]]
---
    def destroy
        if share = ArtworkShare.destroy(params[:id])