W6D4/01_routes_project_p2/app/controllers/artworks_controller.rb

SELECT "artworks"."id" FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 14]]
SELECT "artworks"."id" FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 14]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def index
        # params[:user_id]
        artworks_owned = Artwork.where(artist_id: params[:user_id]).pluck(:id)
        artworks_shared = Artwork.joins(:shared_viewers).where(artwork_shares: { viewer_id: params[:user_id] }).pluck(:id)
        all_ids = artworks_owned + artworks_shared

        # all_artworks = Artwork.joins(:shared_viewers)
        #                     .where(artist_id: params[:user_id])
        #                     .or(artwork_shares: { viewer_id: params[:user_id] })
        #                     .pluck(:id)

        render json: Artwork.where(id: all_ids)

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "nicepainting"], ["image_url", "oranges.com"], ["artist_id", 13]]
---
    def create
        artwork = Artwork.new(self.artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def show
        if artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1 WHERE "artworks"."id" = $2  [["artist_id", 14], ["id", 9]]
---
    def update
        if artwork = Artwork.find(params[:id])
            artwork.update(self.artwork_params)