W6D4/01_routes_project_p2/app/controllers/comments_controller.rb

    def index
        if params[:user_id] && params[:artwork_id]
            render json: Comment.where(user_id: params[:user_id]).where(artwork_id: params[:artwork_id])
        elsif params[:user_id]
            #index on artwork_id code
            render json: Comment.where(user_id: params[:user_id])
        elsif params[:artwork_id]
            #index on user_id code
            render json: Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."artwork_id" = $2  [["user_id", 19], ["artwork_id", 11]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 20]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 10]]

    def create
        comment = Comment.create(self.comment_params)
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 19], ["artwork_id", 11], ["body", "Nonsense on the keyboard"]]