W6D4/01_routes_project_p2/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username SIMILAR TO '%tim%')
---
    def index(query=nil)
        query ||= params[:username] ||= ""
        users = User.where("username SIMILAR TO '%#{query}%'")

INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "Aatef"]]
---
    def create
        user = User.new(self.user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        user_id = params[:id]
        return self.index(user_id) unless user_id.is_a?(Integer)
        begin
            user = User.find(user_id)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        if user = User.destroy(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Timothy"], ["id", 1]]
---
    def update
        begin
            user = User.find(params[:id])
            user.update(self.user_params)